// Müzikal Notalar ve Frekans Tablosu (Hz) — Kromatik 12-Ton + Caz/Neo-Soul Akor Uzantıları
export const NOTES: Record<string, number> = {
  // 1. Oktav (Derin Sub-Bass)
  C1: 32.7, Cs1: 34.65, Db1: 34.65, D1: 36.71, Ds1: 38.89, Eb1: 38.89, E1: 41.2,
  F1: 43.65, Fs1: 46.25, Gb1: 46.25, G1: 49.0, Gs1: 51.91, Ab1: 51.91, A1: 55.0,
  As1: 58.27, Bb1: 58.27, B1: 61.74,

  // 2. Oktav (Bas Gövdesi)
  C2: 65.41, Cs2: 69.3, Db2: 69.3, D2: 73.42, Ds2: 77.78, Eb2: 77.78, E2: 82.41,
  F2: 87.31, Fs2: 92.5, Gb2: 92.5, G2: 98.0, Gs2: 103.83, Ab2: 103.83, A2: 110.0,
  As2: 116.54, Bb2: 116.54, B2: 123.47,

  // 3. Oktav (Tenor / Rhodes Düşük Sesler)
  C3: 130.81, Cs3: 138.59, Db3: 138.59, D3: 146.83, Ds3: 155.56, Eb3: 155.56, E3: 164.81,
  F3: 174.61, Fs3: 185.0, Gb3: 185.0, G3: 196.0, Gs3: 207.65, Ab3: 207.65, A3: 220.0,
  As3: 233.08, Bb3: 233.08, B3: 246.94,

  // 4. Oktav (Rhodes Ana Akor Bölgesi)
  C4: 261.63, Cs4: 277.18, Db4: 277.18, D4: 293.66, Ds4: 311.13, Eb4: 311.13, E4: 329.63,
  F4: 349.23, Fs4: 369.99, Gb4: 369.99, G4: 392.0, Gs4: 415.3, Ab4: 415.3, A4: 440.0,
  As4: 466.16, Bb4: 466.16, B4: 493.88,

  // 5. Oktav (Melodi ve Üst Gerilim 9/11/13)
  C5: 523.25, Cs5: 554.37, Db5: 554.37, D5: 587.33, Ds5: 622.25, Eb5: 622.25, E5: 659.25,
  F5: 698.46, Fs5: 739.99, Gb5: 739.99, G5: 783.99, Gs5: 830.61, Ab5: 830.61, A5: 880.0,
  As5: 932.33, Bb5: 932.33, B5: 987.77,

  // 6. Oktav (Tine Çan Armonikleri ve İnce Parıltılar)
  C6: 1046.5, Cs6: 1108.73, Db6: 1108.73, D6: 1174.66, Ds6: 1244.51, Eb6: 1244.51, E6: 1318.51,
  F6: 1396.91, Fs6: 1479.98, Gb6: 1479.98, G6: 1567.98, Gs6: 1661.22, Ab6: 1661.22, A6: 1760.0,
  As6: 1864.66, Bb6: 1864.66, B6: 1975.53
}
